<template>
  <ve-bar :data="chartData" style="width:50%"></ve-bar>
</template>

<script>
export default {
  data () {
    return {
      chartData: {
        columns: ['日期', '不良项目', '次品数量', '次品率'],
        rows: [
          { 日期: '1/1', 不良项目: 13, 次品数量: 10, 次品率: 0.32 },
          { 日期: '1/2', 不良项目: 35, 次品数量: 32, 次品率: 0.26 },
          { 日期: '1/3', 不良项目: 29, 次品数量: 26, 次品率: 0.76 },
          { 日期: '1/4', 不良项目: 17, 次品数量: 14, 次品率: 0.49 },
          { 日期: '1/5', 不良项目: 37, 次品数量: 34, 次品率: 0.323 },
          { 日期: '1/6', 不良项目: 45, 次品数量: 42, 次品率: 0.78 }
        ]
      }
    }
  }
}
</script>
